GreatCowBASIC/DATFileGenerator/incfiles/p18F05Q20.inc
;----- PIR0 Bits -----------------------------------------------------
SWIF             EQU  H'0000'
INT0IF           EQU  H'0001'
INT1IF           EQU  H'0002'
INT2IF           EQU  H'0003'
DMA1SCNTIF       EQU  H'0004'
DMA1DCNTIF       EQU  H'0005'
DMA1ORIF         EQU  H'0006'
DMA1AIF          EQU  H'0007'


;----- PIR2 Bits -----------------------------------------------------
DMA4SCNTIF       EQU  H'0000'
DMA4DCNTIF       EQU  H'0001'
DMA4ORIF         EQU  H'0002'
DMA4AIF          EQU  H'0003'
NVMIF            EQU  H'0004'
CRCIF            EQU  H'0005'
SCANIF           EQU  H'0006'
ACTIF            EQU  H'0007'


;----- PIR3 Bits -----------------------------------------------------
CSWIF            EQU  H'0000'
OSFIF            EQU  H'0001'
VDDIO2IF         EQU  H'0002'
IOCIF            EQU  H'0004'
TMR0IF           EQU  H'0005'
TMR1IF           EQU  H'0006'
TMR1GIF          EQU  H'0007'


;----- PIR4 Bits -----------------------------------------------------
TMR2IF           EQU  H'0000'
TMR4IF           EQU  H'0001'
TU16AIF          EQU  H'0002'
TU16BIF          EQU  H'0003'
CCP1IF           EQU  H'0004'
CCP2IF           EQU  H'0005'
PWM1PIF          EQU  H'0006'
PWM1IF           EQU  H'0007'


;----- PIR5 Bits -----------------------------------------------------
PWM2PIF          EQU  H'0000'
PWM2IF           EQU  H'0001'
CWG1IF           EQU  H'0002'
CLC1IF           EQU  H'0003'
CLC2IF           EQU  H'0004'
CLC3IF           EQU  H'0005'
CLC4IF           EQU  H'0006'
IOCSRIF          EQU  H'0007'


;----- PIR6 Bits -----------------------------------------------------
U1RXIF           EQU  H'0000'
U1TXIF           EQU  H'0001'
U1IF             EQU  H'0002'
U1EIF            EQU  H'0003'
U2RXIF           EQU  H'0004'
U2TXIF           EQU  H'0005'
U2IF             EQU  H'0006'
U2EIF            EQU  H'0007'


;----- PIR7 Bits -----------------------------------------------------
SPI1RXIF         EQU  H'0000'
SPI1TXIF         EQU  H'0001'
SPI1IF           EQU  H'0002'
I2C1RXIF         EQU  H'0003'
I2C1TXIF         EQU  H'0004'
I2C1IF           EQU  H'0005'
I2C1EIF          EQU  H'0006'


;----- PIR8 Bits -----------------------------------------------------
I3C1RXIF         EQU  H'0000'
I3C1TXIF         EQU  H'0001'
I3C1IF           EQU  H'0002'
I3C1EIF          EQU  H'0003'
I3C1RIF          EQU  H'0004'


;----- PIR9 Bits -----------------------------------------------------
HLVDIF           EQU  H'0005'
ADIF             EQU  H'0006'
ADTIF            EQU  H'0007'


;----- PIE0 Bits -----------------------------------------------------
SWIE             EQU  H'0000'
INT0IE           EQU  H'0001'
INT1IE           EQU  H'0002'
INT2IE           EQU  H'0003'
DMA1SCNTIE       EQU  H'0004'
DMA1DCNTIE       EQU  H'0005'
DMA1ORIE         EQU  H'0006'
DMA1AIE          EQU  H'0007'


;----- PIE2 Bits -----------------------------------------------------
DMA4SCNTIE       EQU  H'0000'
DMA4DCNTIE       EQU  H'0001'
DMA4ORIE         EQU  H'0002'
DMA4AIE          EQU  H'0003'
NVMIE            EQU  H'0004'
CRCIE            EQU  H'0005'
SCANIE           EQU  H'0006'
ACTIE            EQU  H'0007'


;----- PIE3 Bits -----------------------------------------------------
CSWIE            EQU  H'0000'
OSFIE            EQU  H'0001'
VDDIO2IE         EQU  H'0002'
IOCIE            EQU  H'0004'
TMR0IE           EQU  H'0005'
TMR1IE           EQU  H'0006'
TMR1GIE          EQU  H'0007'


;----- PIE4 Bits -----------------------------------------------------
TMR2IE           EQU  H'0000'
TMR4IE           EQU  H'0001'
TU16AIE          EQU  H'0002'
TU16BIE          EQU  H'0003'
CCP1IE           EQU  H'0004'
CCP2IE           EQU  H'0005'
PWM1PIE          EQU  H'0006'
PWM1IE           EQU  H'0007'


;----- PIE5 Bits -----------------------------------------------------
PWM2PIE          EQU  H'0000'
PWM2IE           EQU  H'0001'
CWG1IE           EQU  H'0002'
CLC1IE           EQU  H'0003'
CLC2IE           EQU  H'0004'
CLC3IE           EQU  H'0005'
CLC4IE           EQU  H'0006'
IOCSRIE          EQU  H'0007'


;----- PIE6 Bits -----------------------------------------------------
U1RXIE           EQU  H'0000'
U1TXIE           EQU  H'0001'
U1IE             EQU  H'0002'
U1EIE            EQU  H'0003'
U2RXIE           EQU  H'0004'
U2TXIE           EQU  H'0005'
U2IE             EQU  H'0006'
U2EIE            EQU  H'0007'


;----- PIE7 Bits -----------------------------------------------------
SPI1RXIE         EQU  H'0000'
SPI1TXIE         EQU  H'0001'
SPI1IE           EQU  H'0002'
I2C1RXIE         EQU  H'0003'
I2C1TXIE         EQU  H'0004'
I2C1IE           EQU  H'0005'
I2C1EIE          EQU  H'0006'


;----- PIE8 Bits -----------------------------------------------------
I3C1RXIE         EQU  H'0000'
I3C1TXIE         EQU  H'0001'
I3C1IE           EQU  H'0002'
I3C1EIE          EQU  H'0003'
I3C1RIE          EQU  H'0004'


;----- PIE9 Bits -----------------------------------------------------
HLVDIE           EQU  H'0005'
ADIE             EQU  H'0006'
ADTIE            EQU  H'0007'


;----- IPR0 Bits -----------------------------------------------------
SWIP             EQU  H'0000'
INT0IP           EQU  H'0001'
INT1IP           EQU  H'0002'
INT2IP           EQU  H'0003'
DMA1SCNTIP       EQU  H'0004'
DMA1DCNTIP       EQU  H'0005'
DMA1ORIP         EQU  H'0006'
DMA1AIP          EQU  H'0007'


;----- IPR2 Bits -----------------------------------------------------
DMA4SCNTIP       EQU  H'0000'
DMA4DCNTIP       EQU  H'0001'
DMA4ORIP         EQU  H'0002'
DMA4AIP          EQU  H'0003'
NVMIP            EQU  H'0004'
CRCIP            EQU  H'0005'
SCANIP           EQU  H'0006'
ACTIP            EQU  H'0007'


;----- IPR3 Bits -----------------------------------------------------
CSWIP            EQU  H'0000'
OSFIP            EQU  H'0001'
VDDIO2IP         EQU  H'0002'
IOCIP            EQU  H'0004'
TMR0IP           EQU  H'0005'
TMR1IP           EQU  H'0006'
TMR1GIP          EQU  H'0007'


;----- IPR4 Bits -----------------------------------------------------
TMR2IP           EQU  H'0000'
TMR4IP           EQU  H'0001'
TU16AIP          EQU  H'0002'
TU16BIP          EQU  H'0003'
CCP1IP           EQU  H'0004'
CCP2IP           EQU  H'0005'
PWM1PIP          EQU  H'0006'
PWM1IP           EQU  H'0007'


;----- IPR5 Bits -----------------------------------------------------
PWM2PIP          EQU  H'0000'
PWM2IP           EQU  H'0001'
CWG1IP           EQU  H'0002'
CLC1IP           EQU  H'0003'
CLC2IP           EQU  H'0004'
CLC3IP           EQU  H'0005'
CLC4IP           EQU  H'0006'
IOCSRIP          EQU  H'0007'


;----- IPR6 Bits -----------------------------------------------------
U1RXIP           EQU  H'0000'
U1TXIP           EQU  H'0001'
U1IP             EQU  H'0002'
U1EIP            EQU  H'0003'
U2RXIP           EQU  H'0004'
U2TXIP           EQU  H'0005'
U2IP             EQU  H'0006'
U2EIP            EQU  H'0007'


;----- IPR7 Bits -----------------------------------------------------
SPI1RXIP         EQU  H'0000'
SPI1TXIP         EQU  H'0001'
SPI1IP           EQU  H'0002'
I2C1RXIP         EQU  H'0003'
I2C1TXIP         EQU  H'0004'
I2C1IP           EQU  H'0005'
I2C1EIP          EQU  H'0006'


;----- IPR8 Bits -----------------------------------------------------
I3C1RXIP         EQU  H'0000'
I3C1TXIP         EQU  H'0001'
I3C1IP           EQU  H'0002'
I3C1EIP          EQU  H'0003'
I3C1RIP          EQU  H'0004'


;----- IPR9 Bits -----------------------------------------------------
HLVDIP           EQU  H'0005'
ADIP             EQU  H'0006'
ADTIP            EQU  H'0007'


